#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ABP_LockerCamera.ABP_LockerCamera_C.AnimGraph
	 */
	struct UABP_LockerCamera_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function ABP_LockerCamera.ABP_LockerCamera_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LockerCamera_AnimGraphNode_TransitionResult_AC38B9A64AB3D7DE9ADF53B53137FC4F
	 */
	struct UABP_LockerCamera_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LockerCamera_AnimGraphNode_TransitionResult_AC38B9A64AB3D7DE9ADF53B53137FC4F_Params
	{	};

	/**
	 * Function ABP_LockerCamera.ABP_LockerCamera_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LockerCamera_AnimGraphNode_TransitionResult_B355280E44F0BE2E3CF9FE89E2590B32
	 */
	struct UABP_LockerCamera_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LockerCamera_AnimGraphNode_TransitionResult_B355280E44F0BE2E3CF9FE89E2590B32_Params
	{	};

	/**
	 * Function ABP_LockerCamera.ABP_LockerCamera_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LockerCamera_AnimGraphNode_TransitionResult_A135CD6043F988DD1EFAB38CF7B8817F
	 */
	struct UABP_LockerCamera_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LockerCamera_AnimGraphNode_TransitionResult_A135CD6043F988DD1EFAB38CF7B8817F_Params
	{	};

	/**
	 * Function ABP_LockerCamera.ABP_LockerCamera_C.BlueprintUpdateAnimation
	 */
	struct UABP_LockerCamera_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ABP_LockerCamera.ABP_LockerCamera_C.CustomEvent_1
	 */
	struct UABP_LockerCamera_C_CustomEvent_1_Params
	{
	public:
		class ABP_Locker_C*                                        LockerRef;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ABP_LockerCamera.ABP_LockerCamera_C.ExecuteUbergraph_ABP_LockerCamera
	 */
	struct UABP_LockerCamera_C_ExecuteUbergraph_ABP_LockerCamera_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_K7LB[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
