#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.UserConstructionScript
	 */
	struct ABP_BabyHuggy_C_UserConstructionScript_Params
	{	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.OnNotifyEnd_A156AB274D7731BD2EED2181AFB9A6C4
	 */
	struct ABP_BabyHuggy_C_OnNotifyEnd_A156AB274D7731BD2EED2181AFB9A6C4_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.OnNotifyBegin_A156AB274D7731BD2EED2181AFB9A6C4
	 */
	struct ABP_BabyHuggy_C_OnNotifyBegin_A156AB274D7731BD2EED2181AFB9A6C4_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.OnInterrupted_A156AB274D7731BD2EED2181AFB9A6C4
	 */
	struct ABP_BabyHuggy_C_OnInterrupted_A156AB274D7731BD2EED2181AFB9A6C4_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.OnBlendOut_A156AB274D7731BD2EED2181AFB9A6C4
	 */
	struct ABP_BabyHuggy_C_OnBlendOut_A156AB274D7731BD2EED2181AFB9A6C4_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.OnCompleted_A156AB274D7731BD2EED2181AFB9A6C4
	 */
	struct ABP_BabyHuggy_C_OnCompleted_A156AB274D7731BD2EED2181AFB9A6C4_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.BabyHuggyScream
	 */
	struct ABP_BabyHuggy_C_BabyHuggyScream_Params
	{	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.ReceiveBeginPlay
	 */
	struct ABP_BabyHuggy_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.RotateBaby
	 */
	struct ABP_BabyHuggy_C_RotateBaby_Params
	{	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.BndEvt__BP_BabyHuggy_AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature
	 */
	struct ABP_BabyHuggy_C_BndEvt__BP_BabyHuggy_AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FAIStimulus                                         Stimulus;                                                // 0x0008(0x003C)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.ReceiveTick
	 */
	struct ABP_BabyHuggy_C_ReceiveTick_Params
	{
	public:
		float                                                      DeltaSeconds;                                            // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_BabyHuggy.BP_BabyHuggy_C.ExecuteUbergraph_BP_BabyHuggy
	 */
	struct ABP_BabyHuggy_C_ExecuteUbergraph_BP_BabyHuggy_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
