#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.GetScaleDesiredSize
	 */
	struct UBPI_NavMarkWidgetInterface_C_GetScaleDesiredSize_Params
	{
	public:
		struct FVector2D                                           Result;                                                  // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.SetScaleUsingSize
	 */
	struct UBPI_NavMarkWidgetInterface_C_SetScaleUsingSize_Params
	{
	public:
		float                                                      IpScale;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.UpdateMapRotate
	 */
	struct UBPI_NavMarkWidgetInterface_C_UpdateMapRotate_Params
	{
	public:
		float                                                      Angle;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.UpdateParentAngle
	 */
	struct UBPI_NavMarkWidgetInterface_C_UpdateParentAngle_Params
	{
	public:
		float                                                      ParentAngle;                                             // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.SetArrowAngle
	 */
	struct UBPI_NavMarkWidgetInterface_C_SetArrowAngle_Params
	{
	public:
		float                                                      Angle;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.Show
	 */
	struct UBPI_NavMarkWidgetInterface_C_Show_Params
	{
	public:
		bool                                                       IsShow;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.UpdateMainText
	 */
	struct UBPI_NavMarkWidgetInterface_C_UpdateMainText_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.ShowOffScreenArrow
	 */
	struct UBPI_NavMarkWidgetInterface_C_ShowOffScreenArrow_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.UpdateIndicatorOffScreenAngle
	 */
	struct UBPI_NavMarkWidgetInterface_C_UpdateIndicatorOffScreenAngle_Params
	{
	public:
		float                                                      Angle;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BPI_NavMarkWidgetInterface.BPI_NavMarkWidgetInterface_C.UpdateDistance
	 */
	struct UBPI_NavMarkWidgetInterface_C_UpdateDistance_Params
	{
	public:
		float                                                      Distance;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
