#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction Playtime_Multiplayer.ActorConnection.OnConnectionStopped__DelegateSignature
	 */
	struct AActorConnection_OnConnectionStopped__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Playtime_Multiplayer.ActorConnection.OnConnectionBroken__DelegateSignature
	 */
	struct AActorConnection_OnConnectionBroken__DelegateSignature_Params
	{
	public:
		class AActorConnection*                                    Connection;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ActorConnection.IsComponentLastInConnection
	 */
	struct AActorConnection_IsComponentLastInConnection_Params
	{
	public:
		class USceneComponent*                                     Component;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ActorConnection.IsComponentInConnection
	 */
	struct AActorConnection_IsComponentInConnection_Params
	{
	public:
		class USceneComponent*                                     Component;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ActorConnection.HandleComponentWantsToDisconnect
	 */
	struct AActorConnection_HandleComponentWantsToDisconnect_Params
	{
	public:
		class USceneComponent*                                     Component;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ActorConnection.AddComponentToConnection
	 */
	struct AActorConnection_AddComponentToConnection_Params
	{
	public:
		class USceneComponent*                                     NewComponent;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.PlaytimeCharacter.ShowTooltipIfAllowed
	 */
	struct APlaytimeCharacter_ShowTooltipIfAllowed_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UTooltipComponent*                                   Tooltip;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.PlaytimeCharacter.Server_KnockBack
	 */
	struct APlaytimeCharacter_Server_KnockBack_Params
	{
	public:
		struct FVector                                             KnockBackOrigin;                                         // 0x0000(0x000C)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Horizontal;                                              // 0x000C(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Vertical;                                                // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.PlaytimeCharacter.OnTargetPerceptionUpdated
	 */
	struct APlaytimeCharacter_OnTargetPerceptionUpdated_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAIStimulus                                         Stimulus;                                                // 0x0008(0x003C)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.TurnOnJokeTimer
	 */
	struct AANetworkCharacter_TurnOnJokeTimer_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.TurnOffJokeTimer
	 */
	struct AANetworkCharacter_TurnOffJokeTimer_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.TakeAnyDamage
	 */
	struct AANetworkCharacter_TakeAnyDamage_Params
	{
	public:
		class AActor*                                              DamagedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Damage;                                                  // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_0ISK[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UDamageType*                                         DamageType;                                              // 0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AController*                                         InstigatedBy;                                            // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              DamageCauser;                                            // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.ShouldLeaveFootprint
	 */
	struct AANetworkCharacter_ShouldLeaveFootprint_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.SetPlayerNeedsRevivedWithNotify
	 */
	struct AANetworkCharacter_SetPlayerNeedsRevivedWithNotify_Params
	{
	public:
		bool                                                       Value;                                                   // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.SetLocalPerksThenReplicate
	 */
	struct AANetworkCharacter_SetLocalPerksThenReplicate_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.SetInteractedInterface
	 */
	struct AANetworkCharacter_SetInteractedInterface_Params
	{
	public:
		class UObject*                                             Interactable;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.SetHealthWithNotifyClamped
	 */
	struct AANetworkCharacter_SetHealthWithNotifyClamped_Params
	{
	public:
		float                                                      In_Health;                                               // 0x0000(0x0004)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.ServerOnly_DropToyPart
	 */
	struct AANetworkCharacter_ServerOnly_DropToyPart_Params
	{
	public:
		bool                                                       SpawnDrop;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_G7HZ[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             CustomLocation;                                          // 0x0004(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.Server_SetSharedLookPitch
	 */
	struct AANetworkCharacter_Server_SetSharedLookPitch_Params
	{
	public:
		float                                                      Pitch;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.Server_SetPerks
	 */
	struct AANetworkCharacter_Server_SetPerks_Params
	{
	public:
		struct FPerkPackage                                        In_PerkSaveGame;                                         // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.Server_DropToyPart
	 */
	struct AANetworkCharacter_Server_DropToyPart_Params
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.PseudoConstruct
	 */
	struct AANetworkCharacter_PseudoConstruct_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.OnRep_PlayerNeedsRevived
	 */
	struct AANetworkCharacter_OnRep_PlayerNeedsRevived_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.OnRep_PerkSaveGame
	 */
	struct AANetworkCharacter_OnRep_PerkSaveGame_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.OnRep_HeldToyPartLimb
	 */
	struct AANetworkCharacter_OnRep_HeldToyPartLimb_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.OnRep_HeldToyPartIndex
	 */
	struct AANetworkCharacter_OnRep_HeldToyPartIndex_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.OnRep_Health
	 */
	struct AANetworkCharacter_OnRep_Health_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.OnRep_GrabpackBroken
	 */
	struct AANetworkCharacter_OnRep_GrabpackBroken_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.ObtainInteractedInterface
	 */
	struct AANetworkCharacter_ObtainInteractedInterface_Params
	{
	public:
		bool                                                       OutIsValid;                                              // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_Y1KF[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UObject*                                             ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.JokeTimer
	 */
	struct AANetworkCharacter_JokeTimer_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.InputAction_RightHandExtend_Released
	 */
	struct AANetworkCharacter_InputAction_RightHandExtend_Released_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.InputAction_RightHandExtend_Pressed
	 */
	struct AANetworkCharacter_InputAction_RightHandExtend_Pressed_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.InputAction_LeftHandExtend_Released
	 */
	struct AANetworkCharacter_InputAction_LeftHandExtend_Released_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.InputAction_LeftHandExtend_Pressed
	 */
	struct AANetworkCharacter_InputAction_LeftHandExtend_Pressed_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.IncrementPlayerStat
	 */
	struct AANetworkCharacter_IncrementPlayerStat_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EPlayerStatistics                                          Stat;                                                    // 0x0004(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.HandStateChange
	 */
	struct AANetworkCharacter_HandStateChange_Params
	{
	public:
		class UUHandRigPackageComponent*                           Pkg;                                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EHandStateChange                                           HandStateChange;                                         // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.GetPlaytimeMovementComponent
	 */
	struct AANetworkCharacter_GetPlaytimeMovementComponent_Params
	{
	public:
		class UPlaytimeMovementComponent*                          ReturnValue;                                             // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.Client_PlayDamageFX
	 */
	struct AANetworkCharacter_Client_PlayDamageFX_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_TakeAnyDamageWhileAlive
	 */
	struct AANetworkCharacter_BP_TakeAnyDamageWhileAlive_Params
	{
	public:
		class AActor*                                              DamagedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Damage;                                                  // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_VFEU[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UDamageType*                                         DamageType;                                              // 0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AController*                                         InstigatedBy;                                            // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              DamageCauser;                                            // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bKillingHit;                                             // 0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_SpawnDroppedToyPart
	 */
	struct AANetworkCharacter_BP_SpawnDroppedToyPart_Params
	{
	public:
		int32_t                                                    ToyPartIndex;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             CustomLocation;                                          // 0x0004(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_PlayDamageFX
	 */
	struct AANetworkCharacter_BP_PlayDamageFX_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_OnRep_SavedPerksChanged
	 */
	struct AANetworkCharacter_BP_OnRep_SavedPerksChanged_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_OnRep_PlayerNeedsRevived
	 */
	struct AANetworkCharacter_BP_OnRep_PlayerNeedsRevived_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_OnRep_PerkSaveGame
	 */
	struct AANetworkCharacter_BP_OnRep_PerkSaveGame_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_OnRep_HeldToyPartIndex
	 */
	struct AANetworkCharacter_BP_OnRep_HeldToyPartIndex_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_OnRep_Health
	 */
	struct AANetworkCharacter_BP_OnRep_Health_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_GetThirdPersonMesh
	 */
	struct AANetworkCharacter_BP_GetThirdPersonMesh_Params
	{
	public:
		class USkeletalMeshComponent*                              ReturnValue;                                             // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_GetHeldToyPart
	 */
	struct AANetworkCharacter_BP_GetHeldToyPart_Params
	{
	public:
		class UStaticMeshComponent*                                ReturnValue;                                             // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.BP_GetCameraComponent
	 */
	struct AANetworkCharacter_BP_GetCameraComponent_Params
	{
	public:
		class UCameraComponent*                                    ReturnValue;                                             // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkCharacter.Authority_SetGrabpackBroken
	 */
	struct AANetworkCharacter_Authority_SetGrabpackBroken_Params
	{
	public:
		bool                                                       In_Broken;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkFist.IsRetractingBackward
	 */
	struct AANetworkFist_IsRetractingBackward_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkFist.GetOwningCharacter
	 */
	struct AANetworkFist_GetOwningCharacter_Params
	{
	public:
		class AActor*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkFist.DetachAndRetract
	 */
	struct AANetworkFist_DetachAndRetract_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkHand.Multicast_GrabOntoPrimitive
	 */
	struct AANetworkHand_Multicast_GrabOntoPrimitive_Params
	{
	public:
		class UPrimitiveComponent*                                 Primitive;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UUNetworkGrabComponent*                              In_GrabComponent;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UHandMagnetComponent*                                In_MagnetComponent;                                      // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkHand.GetOwningCharacter
	 */
	struct AANetworkHand_GetOwningCharacter_Params
	{
	public:
		class AANetworkCharacter*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkHand.GetAnimInstance
	 */
	struct AANetworkHand_GetAnimInstance_Params
	{
	public:
		class UAnimInstance*                                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ANetworkHand.DetermineVisuals
	 */
	struct AANetworkHand_DetermineVisuals_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkHand.DetachAndRetract
	 */
	struct AANetworkHand_DetachAndRetract_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ANetworkHand.CheckWire
	 */
	struct AANetworkHand_CheckWire_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ConnectionsInterface.EstablishConnection
	 */
	struct UConnectionsInterface_EstablishConnection_Params
	{
	public:
		class USceneComponent*                                     ConnectedComponent;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ConnectionsInterface.BreakConnection
	 */
	struct UConnectionsInterface_BreakConnection_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.ConnectionsManagerComponent.StopCurrentConnection
	 */
	struct UConnectionsManagerComponent_StopCurrentConnection_Params
	{	};

	/**
	 * DelegateFunction Playtime_Multiplayer.ConnectionsManagerComponent.OnStateChanged__DelegateSignature
	 */
	struct UConnectionsManagerComponent_OnStateChanged__DelegateSignature_Params
	{
	public:
		EManagerConnectionState                                    NewState;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ConnectionsManagerComponent.HandleConnectionBroken
	 */
	struct UConnectionsManagerComponent_HandleConnectionBroken_Params
	{
	public:
		class AActorConnection*                                    Connection;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ConnectionsManagerComponent.GetState
	 */
	struct UConnectionsManagerComponent_GetState_Params
	{
	public:
		EManagerConnectionState                                    ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.ConnectionsManagerComponent.AddToConnection
	 */
	struct UConnectionsManagerComponent_AddToConnection_Params
	{
	public:
		class USceneComponent*                                     NewComponent;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.SaveCosmetics
	 */
	struct UCosmeticFunctionLibrary_SaveCosmetics_Params
	{
	public:
		class UCustomizationSaveGame*                              In_SaveGame;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.LoadCosmetics
	 */
	struct UCosmeticFunctionLibrary_LoadCosmetics_Params
	{
	public:
		class UCustomizationSaveGame*                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetSoundPackData
	 */
	struct UCosmeticFunctionLibrary_GetSoundPackData_Params
	{
	public:
		int32_t                                                    ID;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_DWMY[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSoundPackEntry                                     ReturnValue;                                             // 0x0008(0x0028)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetShopItemsByEvent
	 */
	struct UCosmeticFunctionLibrary_GetShopItemsByEvent_Params
	{
	public:
		class FString                                              EventName;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<int32_t>                                            ReturnValue;                                             // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetShopItemData
	 */
	struct UCosmeticFunctionLibrary_GetShopItemData_Params
	{
	public:
		int32_t                                                    Item;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MWXZ[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FShopItem                                           ReturnValue;                                             // 0x0008(0x0090)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetRarityColor
	 */
	struct UCosmeticFunctionLibrary_GetRarityColor_Params
	{
	public:
		ECosmeticRarity                                            Rarity;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_I60M[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FLinearColor                                        ReturnValue;                                             // 0x0004(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetRandomItem
	 */
	struct UCosmeticFunctionLibrary_GetRandomItem_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetPlayerCosmeticAnimInstance
	 */
	struct UCosmeticFunctionLibrary_GetPlayerCosmeticAnimInstance_Params
	{
	public:
		struct FCosmetic                                           CosmeticItem;                                            // 0x0000(0x0248)  (Parm, NativeAccessSpecifierPublic)
		class UClass*                                              AnimInstance;                                            // 0x0248(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0250(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetMommySounds
	 */
	struct UCosmeticFunctionLibrary_GetMommySounds_Params
	{
	public:
		class UCustomizationSaveGame*                              Item;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FMommySoundSet                                      ReturnValue;                                             // 0x0008(0x0070)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetMommySoundFor
	 */
	struct UCosmeticFunctionLibrary_GetMommySoundFor_Params
	{
	public:
		struct FMommySoundSet                                      Sounds;                                                  // 0x0000(0x0070)  (ConstParm, Parm, NativeAccessSpecifierPublic)
		EMommySoundSet                                             Set;                                                     // 0x0070(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_X2AG[0x7];                                   // 0x0071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class USoundBase*                                          ReturnValue;                                             // 0x0078(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetItemThumbnail
	 */
	struct UCosmeticFunctionLibrary_GetItemThumbnail_Params
	{
	public:
		int32_t                                                    Item;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_NSTM[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UTexture2D*                                          ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetItemName
	 */
	struct UCosmeticFunctionLibrary_GetItemName_Params
	{
	public:
		int32_t                                                    Item;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_9UJP[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FText                                                ReturnValue;                                             // 0x0008(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetItemData
	 */
	struct UCosmeticFunctionLibrary_GetItemData_Params
	{
	public:
		int32_t                                                    Item;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_924I[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FItem                                               ReturnValue;                                             // 0x0008(0x0050)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetIDsFromSpecifiedTable
	 */
	struct UCosmeticFunctionLibrary_GetIDsFromSpecifiedTable_Params
	{
	public:
		class FString                                              Table;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<int32_t>                                            ReturnValue;                                             // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetHuggySounds
	 */
	struct UCosmeticFunctionLibrary_GetHuggySounds_Params
	{
	public:
		class UCustomizationSaveGame*                              Item;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FHuggySoundSet                                      ReturnValue;                                             // 0x0008(0x0060)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetHuggySoundFor
	 */
	struct UCosmeticFunctionLibrary_GetHuggySoundFor_Params
	{
	public:
		struct FHuggySoundSet                                      Sounds;                                                  // 0x0000(0x0060)  (ConstParm, Parm, NativeAccessSpecifierPublic)
		EHuggySoundSet                                             Set;                                                     // 0x0060(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_R1UN[0x7];                                   // 0x0061(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class USoundBase*                                          ReturnValue;                                             // 0x0068(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetEmoteSimple
	 */
	struct UCosmeticFunctionLibrary_GetEmoteSimple_Params
	{
	public:
		struct FPresetSlot                                         Slot;                                                    // 0x0000(0x0058)  (Parm, NativeAccessSpecifierPublic)
		int32_t                                                    Index;                                                   // 0x0058(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x005C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetDefaultUnlockedItemsOfType
	 */
	struct UCosmeticFunctionLibrary_GetDefaultUnlockedItemsOfType_Params
	{
	public:
		ECosmeticTypeEnum                                          Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_O9DA[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<int32_t>                                            ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetCosmeticTypeName
	 */
	struct UCosmeticFunctionLibrary_GetCosmeticTypeName_Params
	{
	public:
		ECosmeticTypeEnum                                          Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_1A45[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                ReturnValue;                                             // 0x0004(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetCosmeticType
	 */
	struct UCosmeticFunctionLibrary_GetCosmeticType_Params
	{
	public:
		int32_t                                                    Item;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ECosmeticTypeEnum                                          ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetCosmeticsOfType
	 */
	struct UCosmeticFunctionLibrary_GetCosmeticsOfType_Params
	{
	public:
		ECosmeticTypeEnum                                          Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_J7YI[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<int32_t>                                            ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetCosmeticOfTypeFor
	 */
	struct UCosmeticFunctionLibrary_GetCosmeticOfTypeFor_Params
	{
	public:
		ECosmeticTypeEnum                                          Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ECharacterType                                             For;                                                     // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bShowPrivate;                                            // 0x0002(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_NJ3O[0x5];                                   // 0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<int32_t>                                            ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetCosmeticDataByName
	 */
	struct UCosmeticFunctionLibrary_GetCosmeticDataByName_Params
	{
	public:
		class FName                                                Cosmetic;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FCosmetic                                           ReturnValue;                                             // 0x0008(0x0248)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetCosmeticData
	 */
	struct UCosmeticFunctionLibrary_GetCosmeticData_Params
	{
	public:
		int32_t                                                    Item;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_3GK4[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FCosmetic                                           ReturnValue;                                             // 0x0008(0x0248)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetBundleData
	 */
	struct UCosmeticFunctionLibrary_GetBundleData_Params
	{
	public:
		int32_t                                                    ID;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_83FU[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FBundle                                             ReturnValue;                                             // 0x0008(0x0038)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetBoxySounds
	 */
	struct UCosmeticFunctionLibrary_GetBoxySounds_Params
	{
	public:
		class UCustomizationSaveGame*                              Item;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FBoxySoundSet                                       ReturnValue;                                             // 0x0008(0x0078)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetBoxySoundFor
	 */
	struct UCosmeticFunctionLibrary_GetBoxySoundFor_Params
	{
	public:
		struct FBoxySoundSet                                       Sounds;                                                  // 0x0000(0x0078)  (ConstParm, Parm, NativeAccessSpecifierPublic)
		EBoxySoundSet                                              Set;                                                     // 0x0078(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_9HZB[0x7];                                   // 0x0079(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class USoundBase*                                          ReturnValue;                                             // 0x0080(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetAllItems
	 */
	struct UCosmeticFunctionLibrary_GetAllItems_Params
	{
	public:
		TArray<int32_t>                                            ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetAllActions
	 */
	struct UCosmeticFunctionLibrary_GetAllActions_Params
	{
	public:
		TArray<int32_t>                                            ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetActionsOfTypeFor
	 */
	struct UCosmeticFunctionLibrary_GetActionsOfTypeFor_Params
	{
	public:
		ECharacterType                                             For;                                                     // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_Q8VW[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<int32_t>                                            ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.GetActionData
	 */
	struct UCosmeticFunctionLibrary_GetActionData_Params
	{
	public:
		int32_t                                                    Item;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_IMFD[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FAction                                             ReturnValue;                                             // 0x0008(0x00D0)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.ClearMaterialSlots
	 */
	struct UCosmeticFunctionLibrary_ClearMaterialSlots_Params
	{
	public:
		class USkeletalMesh*                                       Mesh;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.ClearCosmetics
	 */
	struct UCosmeticFunctionLibrary_ClearCosmetics_Params
	{
	public:
		struct FPresetSlot                                         Slot;                                                    // 0x0000(0x0058)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CosmeticFunctionLibrary.AsCleanIntArray
	 */
	struct UCosmeticFunctionLibrary_AsCleanIntArray_Params
	{
	public:
		struct FPresetSlot                                         Slot;                                                    // 0x0000(0x0058)  (ConstParm, Parm, NativeAccessSpecifierPublic)
		TArray<int32_t>                                            ReturnValue;                                             // 0x0058(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.UnequipCosmetic
	 */
	struct UCustomizationSaveGame_UnequipCosmetic_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ECosmeticTypeEnum                                          Type;                                                    // 0x0001(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.SetSelectedPreset
	 */
	struct UCustomizationSaveGame_SetSelectedPreset_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_OOEF[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                Index;                                                   // 0x0004(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.Print
	 */
	struct UCustomizationSaveGame_Print_Params
	{	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.IsEmoteEquipped
	 */
	struct UCustomizationSaveGame_IsEmoteEquipped_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_0UAZ[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ID;                                                      // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.IsCosmeticEquipped
	 */
	struct UCustomizationSaveGame_IsCosmeticEquipped_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ECosmeticTypeEnum                                          Type;                                                    // 0x0001(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_DCO7[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ID;                                                      // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.GetSelectedPresetNotByRef
	 */
	struct UCustomizationSaveGame_GetSelectedPresetNotByRef_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_7RUK[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FPresetSlot                                         ReturnValue;                                             // 0x0008(0x0058)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.GetEquippedEmote
	 */
	struct UCustomizationSaveGame_GetEquippedEmote_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_KDCO[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    Slot;                                                    // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.GetEquippedCosmetic
	 */
	struct UCustomizationSaveGame_GetEquippedCosmetic_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ECosmeticTypeEnum                                          Type;                                                    // 0x0001(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_XNWU[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.EquipEmote
	 */
	struct UCustomizationSaveGame_EquipEmote_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_G537[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    Slot;                                                    // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ID;                                                      // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.EquipCosmeticColor
	 */
	struct UCustomizationSaveGame_EquipCosmeticColor_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ECosmeticTypeEnum                                          Type;                                                    // 0x0001(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_4NGQ[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ColorIndex;                                              // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Playtime_Multiplayer.CustomizationSaveGame.EquipCosmetic
	 */
	struct UCustomizationSaveGame_EquipCosmetic_Params
	{
	public:
		ECharacterType                                             Character;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
