#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class Playtime_Multiplayer.CosmeticMeshContainer
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class ACosmeticMeshContainer : public AActor
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.ActorConnection
	 * Size -> 0x0040 (FullSize[0x0260] - InheritedSize[0x0220])
	 */
	class AActorConnection : public AActor
	{
	public:
		unsigned char                                              UnknownData_3X2C[0x40];                                  // 0x0220(0x0040) MISSED OFFSET (PADDING)

	public:
		void OnConnectionStopped__DelegateSignature();
		void OnConnectionBroken__DelegateSignature(class AActorConnection* Connection);
		bool IsComponentLastInConnection(class USceneComponent* Component);
		bool IsComponentInConnection(class USceneComponent* Component);
		void HandleComponentWantsToDisconnect(class USceneComponent* Component);
		void AddComponentToConnection(class USceneComponent* NewComponent);
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.AFirstCPPClass
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class AAFirstCPPClass : public AActor
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.PlaytimeCharacter
	 * Size -> 0x0018 (FullSize[0x04D0] - InheritedSize[0x04B8])
	 */
	class APlaytimeCharacter : public ACharacter
	{
	public:
		class UAISenseConfig_Sight*                                Sight;                                                   // 0x04B8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAIPerceptionComponent*                              PerceptionComponent;                                     // 0x04C0(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_81DX[0x8];                                   // 0x04C8(0x0008) MISSED OFFSET (PADDING)

	public:
		void ShowTooltipIfAllowed(class AActor* Actor, class UTooltipComponent* Tooltip);
		void Server_KnockBack(const struct FVector& KnockBackOrigin, float Horizontal, float Vertical);
		void OnTargetPerceptionUpdated(class AActor* Actor, const struct FAIStimulus& Stimulus);
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.ANetworkCharacter
	 * Size -> 0x0170 (FullSize[0x0640] - InheritedSize[0x04D0])
	 */
	class AANetworkCharacter : public APlaytimeCharacter
	{
	public:
		unsigned char                                              UnknownData_CXHN[0x10];                                  // 0x04D0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USkeletalMesh*                                       GrabpackSkeletalMesh;                                    // 0x04E0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpringArmComponent*                                 CameraSpringArm;                                         // 0x04E8(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCameraComponent*                                    CameraComponent;                                         // 0x04F0(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpringArmComponent*                                 ExtendoHands;                                            // 0x04F8(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                SM_HeldToyPart;                                          // 0x0500(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USplineComponent*                                    SwingPath;                                               // 0x0508(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bGrabpackBroken;                                         // 0x0510(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_20R9[0x7];                                   // 0x0511(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USkeletalMeshComponent*                              FPGrabpackGuns;                                          // 0x0518(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpringArmComponent*                                 LeftSpringArm;                                           // 0x0520(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                SM_LeftLauncherGun;                                      // 0x0528(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMeshComponent*                              SK_LeftHand;                                             // 0x0530(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     LeftHandSpawn;                                           // 0x0538(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UUHandRigPackageComponent*                           LeftHandPkg;                                             // 0x0540(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpringArmComponent*                                 RightSpringArm;                                          // 0x0548(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                SM_RightLauncherGun;                                     // 0x0550(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMeshComponent*                              SK_RightHand;                                            // 0x0558(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     RightHandSpawn;                                          // 0x0560(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UUHandRigPackageComponent*                           RightHandPkg;                                            // 0x0568(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpringArmComponent*                                 TP_PawnControlRotationArm;                               // 0x0570(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpringArmComponent*                                 TP_ShoulderArm;                                          // 0x0578(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpringArmComponent*                                 TP_DistanceArm;                                          // 0x0580(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCameraComponent*                                    TP_Camera;                                               // 0x0588(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FPerkPackage                                        Perks;                                                   // 0x0590(0x0030) BlueprintVisible, Net, RepNotify, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnShotBrokenHand;                                        // 0x05C0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPerkSaveGameChanged;                                   // 0x05D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		bool                                                       bPlayerIsDown;                                           // 0x05E0(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsInsideLocker;                                         // 0x05E1(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsEnteringLocker;                                       // 0x05E2(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsThirdPerson;                                           // 0x05E3(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AvailableWireLength;                                     // 0x05E4(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SharedLookPitch;                                         // 0x05E8(0x0004) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    HeldToyPartIndex;                                        // 0x05EC(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ELimb                                                      HeldToyPartLimb;                                         // 0x05F0(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       PlayerNeedsRevived;                                      // 0x05F1(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X296[0x2];                                   // 0x05F2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxHealth;                                               // 0x05F4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Health;                                                  // 0x05F8(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxWireLength;                                           // 0x05FC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              NetworkHandClass;                                        // 0x0600(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimSequence*                                       HandRetractedAnim;                                       // 0x0608(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTimerHandle                                        JokeTimerHandle;                                         // 0x0610(0x0008) NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             OnAttachmentStateChange;                                 // 0x0618(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected
		class FName                                                TraceTag;                                                // 0x0628(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UObject*                                             InteractedInterface;                                     // 0x0630(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_O2YL[0x8];                                   // 0x0638(0x0008) MISSED OFFSET (PADDING)

	public:
		void TurnOnJokeTimer();
		void TurnOffJokeTimer();
		void TakeAnyDamage(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
		bool ShouldLeaveFootprint();
		void SetPlayerNeedsRevivedWithNotify(bool Value);
		void SetLocalPerksThenReplicate();
		void SetInteractedInterface(class UObject* Interactable);
		void SetHealthWithNotifyClamped(float In_Health);
		void ServerOnly_DropToyPart(bool SpawnDrop, const struct FVector& CustomLocation);
		void Server_SetSharedLookPitch(float Pitch);
		void Server_SetPerks(const struct FPerkPackage& In_PerkSaveGame);
		void Server_DropToyPart(const struct FVector& Location);
		void PseudoConstruct();
		void OnRep_PlayerNeedsRevived();
		void OnRep_PerkSaveGame();
		void OnRep_HeldToyPartLimb();
		void OnRep_HeldToyPartIndex();
		void OnRep_Health();
		void OnRep_GrabpackBroken();
		class UObject* ObtainInteractedInterface(bool* OutIsValid);
		void JokeTimer();
		void InputAction_RightHandExtend_Released();
		void InputAction_RightHandExtend_Pressed();
		void InputAction_LeftHandExtend_Released();
		void InputAction_LeftHandExtend_Pressed();
		void IncrementPlayerStat(float Amount, EPlayerStatistics Stat);
		void HandStateChange(class UUHandRigPackageComponent* Pkg, EHandStateChange HandStateChange);
		class UPlaytimeMovementComponent* GetPlaytimeMovementComponent();
		void Client_PlayDamageFX();
		void BP_TakeAnyDamageWhileAlive(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser, bool bKillingHit);
		void BP_SpawnDroppedToyPart(int32_t ToyPartIndex, const struct FVector& CustomLocation);
		void BP_PlayDamageFX();
		void BP_OnRep_SavedPerksChanged();
		void BP_OnRep_PlayerNeedsRevived();
		void BP_OnRep_PerkSaveGame();
		void BP_OnRep_HeldToyPartIndex();
		void BP_OnRep_Health();
		class USkeletalMeshComponent* BP_GetThirdPersonMesh();
		class UStaticMeshComponent* BP_GetHeldToyPart();
		class UCameraComponent* BP_GetCameraComponent();
		void Authority_SetGrabpackBroken(bool In_Broken);
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.NetworkDashHandle
	 * Size -> 0x0028 (FullSize[0x0248] - InheritedSize[0x0220])
	 */
	class ANetworkDashHandle : public AActor
	{
	public:
		class USceneComponent*                                     RootScene;                                               // 0x0220(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                StaticMeshComponent;                                     // 0x0228(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UArrowComponent*                                     FirstEdge;                                               // 0x0230(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UArrowComponent*                                     SecondEdge;                                              // 0x0238(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UArrowComponent*                                     LowestLocation;                                          // 0x0240(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.ANetworkFist
	 * Size -> 0x00D0 (FullSize[0x02F0] - InheritedSize[0x0220])
	 */
	class AANetworkFist : public AActor
	{
	public:
		bool                                                       IsActive;                                                // 0x0220(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AZM2[0x7];                                   // 0x0221(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UUFistRigPackageComponent*                           FromPkg;                                                 // 0x0228(0x0008) ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class APhysicsConstraintActor*                             AttachConstraint;                                        // 0x0230(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AANetworkCharacter*                                  GrabbedCharacter;                                        // 0x0238(0x0008) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     RootScene;                                               // 0x0240(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                FistPivot;                                               // 0x0248(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     RopeAttachmentScene;                                     // 0x0250(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     AttachConstraintScene;                                   // 0x0258(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCapsuleComponent*                                   RetractionCapsuleConstraint;                             // 0x0260(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionChannel                                          PlayerHandsCollisionChannel;                             // 0x0268(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B38K[0x3];                                   // 0x0269(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ShootSpeed;                                              // 0x026C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PullSpeed;                                               // 0x0270(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxWireLength;                                           // 0x0274(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CurrentWireLength;                                       // 0x0278(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AQNU[0x4];                                   // 0x027C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          OriginalFistPivotTransform;                              // 0x0280(0x0030) IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FCollisionResponseContainer                         OriginalCollisionResponses;                              // 0x02B0(0x0020) NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bShootingForward;                                        // 0x02D0(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bRetractingBackward;                                     // 0x02D1(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_2O0Q[0x6];                                   // 0x02D2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              OwningCharacter;                                         // 0x02D8(0x0008) Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USceneComponent*                                     SpawnPoint;                                              // 0x02E0(0x0008) ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_6B6Z[0x8];                                   // 0x02E8(0x0008) MISSED OFFSET (PADDING)

	public:
		bool IsRetractingBackward();
		class AActor* GetOwningCharacter();
		void DetachAndRetract();
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.ANetworkHand
	 * Size -> 0x01E0 (FullSize[0x0400] - InheritedSize[0x0220])
	 */
	class AANetworkHand : public AActor
	{
	public:
		bool                                                       IsActive;                                                // 0x0220(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsPulling;                                               // 0x0221(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ELimb                                                      Limb;                                                    // 0x0222(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1OC3[0x5];                                   // 0x0223(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UUHandRigPackageComponent*                           FromPkg;                                                 // 0x0228(0x0008) ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class APhysicsConstraintActor*                             AttachConstraint;                                        // 0x0230(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UPrimitiveComponent*                                 GrabbedPrimitive;                                        // 0x0238(0x0008) ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AANetworkCharacter*                                  GrabbedPlayer;                                           // 0x0240(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UUNetworkGrabComponent*                              GrabbedGrabComponent;                                    // 0x0248(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHandMagnetComponent*                                GrabbedMagnetComponent;                                  // 0x0250(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AANetworkSwingHandle*                                GrabbedSwingHandle;                                      // 0x0258(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     RootScene;                                               // 0x0260(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     HandScene;                                               // 0x0268(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                HandPivot;                                               // 0x0270(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMeshComponent*                              SK_Hand;                                                 // 0x0278(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     RopeAttachmentScene;                                     // 0x0280(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     AttachConstraintScene;                                   // 0x0288(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionChannel                                          HandMagnetTraceChannel;                                  // 0x0290(0x0001) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionChannel                                          PlayerHandsCollisionChannel;                             // 0x0291(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IZCP[0x2];                                   // 0x0292(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ShootSpeed;                                              // 0x0294(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PullSpeed;                                               // 0x0298(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      InitialShootSpeed;                                       // 0x029C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GravityStrength;                                         // 0x02A0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CRBQ[0x4];                                   // 0x02A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat*                                         GravityOverDistance;                                     // 0x02A8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MasterArcSpeed;                                          // 0x02B0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7LVX[0x4];                                   // 0x02B4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat*                                         ArcSpeedOverDistance;                                    // 0x02B8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TM5S[0x10];                                  // 0x02C0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxWireLength;                                           // 0x02D0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CurrentWireLength;                                       // 0x02D4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CancellationPause;                                       // 0x02D8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CurrentCancellationTimer;                                // 0x02DC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasBeenCancelled;                                        // 0x02E0(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShootingForward;                                        // 0x02E1(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRetractingBackward;                                     // 0x02E2(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3896[0xD];                                   // 0x02E3(0x000D) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          OriginalHandPivotTransform;                              // 0x02F0(0x0030) IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FCollisionResponseContainer                         OriginalCollisionResponses;                              // 0x0320(0x0020) NoDestructor, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPseudoDestroy;                                         // 0x0340(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPseudoSpawn;                                           // 0x0350(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CWHJ[0x8];                                   // 0x0360(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      GrabbedThickness;                                        // 0x0368(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DistanceFromPalm;                                        // 0x036C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsTouching;                                             // 0x0370(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1ZVC[0x3F];                                  // 0x0371(0x003F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              SK_HandInitialAnimation;                                 // 0x03B0(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnBeginTouch;                                            // 0x03B8(0x0010) Net, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnEndTouch;                                              // 0x03C8(0x0010) Net, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		bool                                                       bGrabbedPlayer;                                          // 0x03D8(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_E431[0x7];                                   // 0x03D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USceneComponent*                                     SpawnPoint;                                              // 0x03E0(0x0008) ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_ILZ5[0x18];                                  // 0x03E8(0x0018) MISSED OFFSET (PADDING)

	public:
		void Multicast_GrabOntoPrimitive(class UPrimitiveComponent* Primitive, class UUNetworkGrabComponent* In_GrabComponent, class UHandMagnetComponent* In_MagnetComponent);
		class AANetworkCharacter* GetOwningCharacter();
		class UAnimInstance* GetAnimInstance();
		void DetermineVisuals();
		void DetachAndRetract();
		void CheckWire();
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.ANetworkSwingHandle
	 * Size -> 0x0030 (FullSize[0x0250] - InheritedSize[0x0220])
	 */
	class AANetworkSwingHandle : public AActor
	{
	public:
		class USceneComponent*                                     RootScene;                                               // 0x0220(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                StaticMeshComponent;                                     // 0x0228(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UArrowComponent*                                     FirstEdge;                                               // 0x0230(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UArrowComponent*                                     SecondEdge;                                              // 0x0238(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UArrowComponent*                                     LowestLocation;                                          // 0x0240(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bGrappleSabotaged;                                       // 0x0248(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0D7Y[0x7];                                   // 0x0249(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.ConnectionsInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UConnectionsInterface : public UInterface
	{
	public:
		void EstablishConnection(class USceneComponent* ConnectedComponent);
		void BreakConnection();
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.ConnectionsManagerComponent
	 * Size -> 0x0040 (FullSize[0x00F0] - InheritedSize[0x00B0])
	 */
	class UConnectionsManagerComponent : public UActorComponent
	{
	public:
		class FScriptMulticastDelegate                             OnStateChanged;                                          // 0x00B0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JO3H[0x30];                                  // 0x00C0(0x0030) MISSED OFFSET (PADDING)

	public:
		void StopCurrentConnection();
		void OnStateChanged__DelegateSignature(EManagerConnectionState NewState);
		void HandleConnectionBroken(class AActorConnection* Connection);
		EManagerConnectionState GetState();
		void AddToConnection(class USceneComponent* NewComponent);
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.ConnectorComponent
	 * Size -> 0x0058 (FullSize[0x0250] - InheritedSize[0x01F8])
	 */
	class UConnectorComponent : public USceneComponent
	{
	public:
		unsigned char                                              UnknownData_YREJ[0x8];                                   // 0x01F8(0x0008) Fix Super Size
		unsigned char                                              UnknownData_SFO0[0x10];                                  // 0x0200(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnConnectionEstablished;                                 // 0x0210(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnConnectionBroken;                                      // 0x0220(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               m_ConnectorTags;                                         // 0x0230(0x0020) Edit, BlueprintVisible, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.CosmeticFunctionLibrary
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UCosmeticFunctionLibrary : public UBlueprintFunctionLibrary
	{
	public:
		void SaveCosmetics(class UCustomizationSaveGame* In_SaveGame);
		class UCustomizationSaveGame* LoadCosmetics();
		struct FSoundPackEntry GetSoundPackData(int32_t ID);
		TArray<int32_t> GetShopItemsByEvent(const class FString& EventName);
		struct FShopItem GetShopItemData(int32_t Item);
		struct FLinearColor GetRarityColor(ECosmeticRarity Rarity);
		int32_t GetRandomItem();
		bool GetPlayerCosmeticAnimInstance(const struct FCosmetic& CosmeticItem, class UClass** AnimInstance);
		struct FMommySoundSet GetMommySounds(class UCustomizationSaveGame* Item);
		class USoundBase* GetMommySoundFor(const struct FMommySoundSet& Sounds, EMommySoundSet Set);
		class UTexture2D* GetItemThumbnail(int32_t Item);
		class FText GetItemName(int32_t Item);
		struct FItem GetItemData(int32_t Item);
		TArray<int32_t> GetIDsFromSpecifiedTable(const class FString& Table);
		struct FHuggySoundSet GetHuggySounds(class UCustomizationSaveGame* Item);
		class USoundBase* GetHuggySoundFor(const struct FHuggySoundSet& Sounds, EHuggySoundSet Set);
		int32_t GetEmoteSimple(const struct FPresetSlot& Slot, int32_t Index);
		TArray<int32_t> GetDefaultUnlockedItemsOfType(ECosmeticTypeEnum Type);
		class FName GetCosmeticTypeName(ECosmeticTypeEnum Type);
		ECosmeticTypeEnum GetCosmeticType(int32_t Item);
		TArray<int32_t> GetCosmeticsOfType(ECosmeticTypeEnum Type);
		TArray<int32_t> GetCosmeticOfTypeFor(ECosmeticTypeEnum Type, ECharacterType For, bool bShowPrivate);
		struct FCosmetic GetCosmeticDataByName(const class FName& Cosmetic);
		struct FCosmetic GetCosmeticData(int32_t Item);
		struct FBundle GetBundleData(int32_t ID);
		struct FBoxySoundSet GetBoxySounds(class UCustomizationSaveGame* Item);
		class USoundBase* GetBoxySoundFor(const struct FBoxySoundSet& Sounds, EBoxySoundSet Set);
		TArray<int32_t> GetAllItems();
		TArray<int32_t> GetAllActions();
		TArray<int32_t> GetActionsOfTypeFor(ECharacterType For);
		struct FAction GetActionData(int32_t Item);
		void ClearMaterialSlots(class USkeletalMesh* Mesh);
		void ClearCosmetics(struct FPresetSlot* Slot);
		TArray<int32_t> AsCleanIntArray(const struct FPresetSlot& Slot);
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.CustomizationSaveGame
	 * Size -> 0x0160 (FullSize[0x0188] - InheritedSize[0x0028])
	 */
	class UCustomizationSaveGame : public USaveGame
	{
	public:
		class FName                                                SelectedSurvivorPreset;                                  // 0x0028(0x0008) BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FName, struct FPresetSlot>                      SurvivorPresets;                                         // 0x0030(0x0050) BlueprintVisible, SaveGame, NativeAccessSpecifierPublic
		class FName                                                SelectedBoxyPreset;                                      // 0x0080(0x0008) BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FName, struct FPresetSlot>                      BoxyPresets;                                             // 0x0088(0x0050) BlueprintVisible, SaveGame, NativeAccessSpecifierPublic
		class FName                                                SelectedHuggyPreset;                                     // 0x00D8(0x0008) BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FName, struct FPresetSlot>                      HuggyPresets;                                            // 0x00E0(0x0050) BlueprintVisible, SaveGame, NativeAccessSpecifierPublic
		class FName                                                SelectedMommyPreset;                                     // 0x0130(0x0008) BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FName, struct FPresetSlot>                      MommyPresets;                                            // 0x0138(0x0050) BlueprintVisible, SaveGame, NativeAccessSpecifierPublic

	public:
		void UnequipCosmetic(ECharacterType Character, ECosmeticTypeEnum Type);
		void SetSelectedPreset(ECharacterType Character, const class FName& Index);
		void Print();
		bool IsEmoteEquipped(ECharacterType Character, int32_t ID);
		bool IsCosmeticEquipped(ECharacterType Character, ECosmeticTypeEnum Type, int32_t ID);
		struct FPresetSlot GetSelectedPresetNotByRef(ECharacterType Character);
		int32_t GetEquippedEmote(ECharacterType Character, int32_t Slot);
		int32_t GetEquippedCosmetic(ECharacterType Character, ECosmeticTypeEnum Type);
		void EquipEmote(ECharacterType Character, int32_t Slot, int32_t ID);
		void EquipCosmeticColor(ECharacterType Character, ECosmeticTypeEnum Type, int32_t ColorIndex);
		void EquipCosmetic(ECharacterType Character, ECosmeticTypeEnum Type, int32_t ID);
		void DirectlySetSelectedPreset(ECharacterType Character, const struct FPresetSlot& Preset);
		void DeletePreset(ECharacterType Character, const class FName& Name);
		int32_t ClampPresetRange(int32_t Num);
		void AddNewPreset(ECharacterType Character, const class FName& Name, const struct FPresetSlot& PresetStruct);
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.CustomNinjaCharacter
	 * Size -> 0x0030 (FullSize[0x0550] - InheritedSize[0x0520])
	 */
	class ACustomNinjaCharacter : public ANinjaCharacter
	{
	public:
		class UCameraComponent*                                    CameraComp;                                              // 0x0520(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class ACustomPlayerController*                             CPC;                                                     // 0x0528(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class AMommyCameraPawn*                                    MommyCamera;                                             // 0x0530(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              MommyCameraPawnClass;                                    // 0x0538(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bUseActorRotation;                                       // 0x0540(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_LRCK[0xF];                                   // 0x0541(0x000F) MISSED OFFSET (PADDING)

	public:
		void SpawnMommyCamera();
		void OnTouchingWallChanged();
		void OnRep_TouchingWall();
		void MoveRight(float Val);
		void MoveForward(float Val);
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.CustomPlayerController
	 * Size -> 0x0008 (FullSize[0x0578] - InheritedSize[0x0570])
	 */
	class ACustomPlayerController : public APlayerController
	{
	public:
		unsigned char                                              UnknownData_5M5P[0x8];                                   // 0x0570(0x0008) MISSED OFFSET (PADDING)

	public:
		void SetViewTargetToMommyCamera();
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.DoorStateMachineComponet
	 * Size -> 0x0078 (FullSize[0x0128] - InheritedSize[0x00B0])
	 */
	class UDoorStateMachineComponet : public UActorComponent
	{
	public:
		class FScriptMulticastDelegate                             InitStateDelegate;                                       // 0x00B0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             EndStateDelegate;                                        // 0x00C0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             TickStateDelegate;                                       // 0x00D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             StateChangedDelegate;                                    // 0x00E0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FGameplayTag                                        StateTag;                                                // 0x00F0(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        InitialStateTag;                                         // 0x00F8(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDebug;                                                  // 0x0100(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UP1P[0x7];                                   // 0x0101(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FGameplayTag>                                StateHistory;                                            // 0x0108(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		int32_t                                                    StateHistoryLength;                                      // 0x0118(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Openness;                                                // 0x011C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D1JS[0x8];                                   // 0x0120(0x0008) MISSED OFFSET (PADDING)

	public:
		bool SwitchState(const struct FGameplayTag& _StateTag);
		void OpenDoor();
		void CloseDoor();
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.DualSplineFollower
	 * Size -> 0x0048 (FullSize[0x0268] - InheritedSize[0x0220])
	 */
	class ADualSplineFollower : public AActor
	{
	public:
		class FScriptMulticastDelegate                             FinishedMoving;                                          // 0x0220(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class USplineComponent*                                    FirstSpline;                                             // 0x0230(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USplineComponent*                                    SecondSpline;                                            // 0x0238(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USceneComponent*                                     RootScene;                                               // 0x0240(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      Progress;                                                // 0x0248(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bIsReversed;                                             // 0x024C(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_UBMT[0x3];                                   // 0x024D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AANetworkCharacter*                                  CharacterToPull;                                         // 0x0250(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      Speed;                                                   // 0x0258(0x0004) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      CrossoverThreshold;                                      // 0x025C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bHasPseudoSpawned;                                       // 0x0260(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_R3KF[0x7];                                   // 0x0261(0x0007) MISSED OFFSET (PADDING)

	public:
		void SetTimeToTake(float TimeToTake);
		void ReverseDirection();
		void Multicast_PseudoSpawn(class USplineComponent* SplineToBaseFirstSplineOn, class USplineComponent* In_SecondSpline, const struct FVector& CharacterLocation);
		void GetCharacterToPull(class AANetworkCharacter** Character);
		void Authority_PseudoSpawn(float TimeToTake, class USplineComponent* SplineToBaseFirstSplineOn, class USplineComponent* In_SecondSpline);
		static UClass* StaticClass();
	};

	/**
	 * Class Playtime_Multiplayer.DynamicMusicSubsystem
	 * Size -> 0x0040 (FullSize[0x0070] - InheritedSize[0x0030])
	 */
	class UDynamicMusicSubsystem : public UGameInstanceSubsystem
	{
	public:
		bool                                                       bIsCrossfading;                                          // 0x0030(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bCurrentAudio;                                           // 0x0031(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_XAHA[0x1E];                                  // 0x0032(0x001E) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UAudioComponent*>                             Audios;                                                  // 0x0050(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate
		class USoundWave*                                          CurrentAmbience;                                         // 0x0060(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FTimerHandle                                        Timer;                                                   // 0x0068(0x0008) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void SetInactiveAudio(class UAudioComponent* Inactive);
		void SetAmbientMusic(class USoundWave* AmbientMusic);
		void SetActiveAudio(class UAudioComponent* Active);
		void ReturnToAmbientMusic(float FadeTime, float NewVolume);
		class UAudioComponent* GetInactiveAudio();
		class UAudioComponent* GetActiveAudio();
