#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.SetCharacterType
	 */
	struct UUI_CustomizeCharacter_C_SetCharacterType_Params
	{
	public:
		ECharacterType                                             NewValue;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.UpdateVisuals
	 */
	struct UUI_CustomizeCharacter_C_UpdateVisuals_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.PreConstruct
	 */
	struct UUI_CustomizeCharacter_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_Customize_AppearanceButton_K2Node_ComponentBoundEvent_1_OnReleased__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_Customize_AppearanceButton_K2Node_ComponentBoundEvent_1_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_Customize_PerksButton_K2Node_ComponentBoundEvent_2_OnReleased__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_Customize_PerksButton_K2Node_ComponentBoundEvent_2_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_Customize_EmotesButton_K2Node_ComponentBoundEvent_3_OnReleased__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_Customize_EmotesButton_K2Node_ComponentBoundEvent_3_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_Customize_PresetsButton_K2Node_ComponentBoundEvent_4_OnReleased__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_Customize_PresetsButton_K2Node_ComponentBoundEvent_4_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.SetCharacter
	 */
	struct UUI_CustomizeCharacter_C_SetCharacter_Params
	{
	public:
		class ABP_NetworkCharacter_C*                              Character;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class ABP_CustomizationMenuCharacter_C*                    MenuCharacter;                                           // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_Customize_TEMP_SabotagesButton_K2Node_ComponentBoundEvent_5_OnReleased__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_Customize_TEMP_SabotagesButton_K2Node_ComponentBoundEvent_5_OnReleased__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.SelectFirstPage
	 */
	struct UUI_CustomizeCharacter_C_SelectFirstPage_Params
	{
	public:
		ECharacterType                                             CharacterType;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_CustomizeCharacter_UI_Appearance_K2Node_ComponentBoundEvent_6_ChangedAppearance__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_CustomizeCharacter_UI_Appearance_K2Node_ComponentBoundEvent_6_ChangedAppearance__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.SetPersistentButtonStyleOnCorrectButton
	 */
	struct UUI_CustomizeCharacter_C_SetPersistentButtonStyleOnCorrectButton_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_CustomizeCharacter_UI_BackButton_K2Node_ComponentBoundEvent_7_Released__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_CustomizeCharacter_UI_BackButton_K2Node_ComponentBoundEvent_7_Released__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_CustomizeCharacter_UI_Emotes_K2Node_ComponentBoundEvent_0_Changed__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_CustomizeCharacter_UI_Emotes_K2Node_ComponentBoundEvent_0_Changed__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_CustomizeCharacter_Button_559_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_CustomizeCharacter_Button_559_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BndEvt__UI_CustomizeCharacter_Button_559_K2Node_ComponentBoundEvent_9_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BndEvt__UI_CustomizeCharacter_Button_559_K2Node_ComponentBoundEvent_9_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.Tick
	 */
	struct UUI_CustomizeCharacter_C_Tick_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		float                                                      InDeltaTime;                                             // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.ExecuteUbergraph_UI_CustomizeCharacter
	 */
	struct UUI_CustomizeCharacter_C_ExecuteUbergraph_UI_CustomizeCharacter_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.MouseDragged__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_MouseDragged__DelegateSignature_Params
	{
	public:
		struct FVector2D                                           DeltaMouse;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.UpdateRotatingCharacter__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_UpdateRotatingCharacter__DelegateSignature_Params
	{
	public:
		bool                                                       Rotating;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.ChangedAppearance__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_ChangedAppearance__DelegateSignature_Params
	{	};

	/**
	 * Function UI_CustomizeCharacter.UI_CustomizeCharacter_C.BackPressed__DelegateSignature
	 */
	struct UUI_CustomizeCharacter_C_BackPressed__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
