#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_PlayerStatus.UI_PlayerStatus_C.UpdatePlayers
	 */
	struct UUI_PlayerStatus_C_UpdatePlayers_Params
	{	};

	/**
	 * Function UI_PlayerStatus.UI_PlayerStatus_C.Construct
	 */
	struct UUI_PlayerStatus_C_Construct_Params
	{	};

	/**
	 * Function UI_PlayerStatus.UI_PlayerStatus_C.PreConstruct
	 */
	struct UUI_PlayerStatus_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_PlayerStatus.UI_PlayerStatus_C.UpdatePlayerHoldingToyPart
	 */
	struct UUI_PlayerStatus_C_UpdatePlayerHoldingToyPart_Params
	{
	public:
		class APlayerState*                                        PlayerState;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UTexture2D*                                          ToyPart;                                                 // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       IsHoldingToyPart;                                        // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_PlayerStatus.UI_PlayerStatus_C.ExecuteUbergraph_UI_PlayerStatus
	 */
	struct UUI_PlayerStatus_C_ExecuteUbergraph_UI_PlayerStatus_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_XZRO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
