#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_Sabotages.UI_Sabotages_C.Get_level3_Text_1
	 */
	struct UUI_Sabotages_C_Get_level3_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.Get_level2_Text_1
	 */
	struct UUI_Sabotages_C_Get_level2_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.Get_level1_Text_1
	 */
	struct UUI_Sabotages_C_Get_level1_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.PreConstruct
	 */
	struct UUI_Sabotages_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.UpdateVisuals
	 */
	struct UUI_Sabotages_C_UpdateVisuals_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.BndEvt__UI_Perks_SelectButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_Sabotages_C_BndEvt__UI_Perks_SelectButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.BndEvt__UI_Perks_UpgradeButton_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_Sabotages_C_BndEvt__UI_Perks_UpgradeButton_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.SabotageButtonPressed
	 */
	struct UUI_Sabotages_C_SabotageButtonPressed_Params
	{
	public:
		class FName                                                Sabotage;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.RefreshUpgradeButton
	 */
	struct UUI_Sabotages_C_RefreshUpgradeButton_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.RefreshBuyButton
	 */
	struct UUI_Sabotages_C_RefreshBuyButton_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.BndEvt__UI_Sabotages_UpgradeButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUI_Sabotages_C_BndEvt__UI_Sabotages_UpgradeButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.BndEvt__UI_Sabotages_UpgradeButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
	 */
	struct UUI_Sabotages_C_BndEvt__UI_Sabotages_UpgradeButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.BndEvt__UI_Sabotages_SelectButton_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature
	 */
	struct UUI_Sabotages_C_BndEvt__UI_Sabotages_SelectButton_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.BndEvt__UI_Sabotages_SelectButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUI_Sabotages_C_BndEvt__UI_Sabotages_SelectButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_Sabotages.UI_Sabotages_C.ExecuteUbergraph_UI_Sabotages
	 */
	struct UUI_Sabotages_C_ExecuteUbergraph_UI_Sabotages_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
