#pragma once

/**
 * Name: Project_Playtime
 * Version: 4_7_23_Hotfix
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_SelectableSabotage.UI_SelectableSabotage_C.PreConstruct
	 */
	struct UUI_SelectableSabotage_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_SelectableSabotage.UI_SelectableSabotage_C.BndEvt__UI_SelectablePerk_TheButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_SelectableSabotage_C_BndEvt__UI_SelectablePerk_TheButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_SelectableSabotage.UI_SelectableSabotage_C.BndEvt__UI_SelectablePerk_TheButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUI_SelectableSabotage_C_BndEvt__UI_SelectablePerk_TheButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_SelectableSabotage.UI_SelectableSabotage_C.BndEvt__UI_SelectablePerk_TheButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUI_SelectableSabotage_C_BndEvt__UI_SelectablePerk_TheButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_SelectableSabotage.UI_SelectableSabotage_C.Update Visuals
	 */
	struct UUI_SelectableSabotage_C_UpdateVisuals_Params
	{	};

	/**
	 * Function UI_SelectableSabotage.UI_SelectableSabotage_C.SetActive
	 */
	struct UUI_SelectableSabotage_C_SetActive_Params
	{
	public:
		bool                                                       Active;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_SelectableSabotage.UI_SelectableSabotage_C.ExecuteUbergraph_UI_SelectableSabotage
	 */
	struct UUI_SelectableSabotage_C_ExecuteUbergraph_UI_SelectableSabotage_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_ELDF[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_SelectableSabotage.UI_SelectableSabotage_C.SabotageButtonReleased__DelegateSignature
	 */
	struct UUI_SelectableSabotage_C_SabotageButtonReleased__DelegateSignature_Params
	{
	public:
		class FName                                                Type;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
